Repository: Omer-Keles/password-manager-app
Catalog: lib/l10n/app_*.arb
Languages: tr

# appName
source: Password Vault
tr: Şifre Kasası

source: Vault
tr: Kasa

source: Passwords
tr: Şifreler

source: Settings
tr: Ayarlar

# welcome
source: Welcome to Your Vault
tr: Şifre Kasana Hoş Geldin

source: New Password
tr: Yeni Şifre

source: Add New
tr: Yeni Ekle

# search
source: Search passwords
tr: Şifreler içinde ara

# searchIn
source: Search
tr: Ara

source: Title
tr: Başlık

# titleHint
source: E.g. Door Code, Card PIN...
tr: Örn. Apartman Kapısı, Kart PIN...

source: Username
tr: Kullanıcı Adı

source: Username (Optional)
tr: Kullanıcı Adı (İsteğe Bağlı)

# usernameHint
source: Email, cardholder or leave empty
tr: E-posta, kart sahibi veya boş

source: Password
tr: Şifre

# passwordOrPin
source: Password / PIN
tr: Şifre / PIN

source: Category
tr: Kategori

# categoryGeneral
source: General
tr: Genel

# categorySocialMedia
source: Social Media
tr: Sosyal Medya

# categoryBankFinance
source: Bank / Finance
tr: Banka / Finans

# categoryEcommerce
source: E-Commerce
tr: E-Ticaret

# categoryWorkCorporate
source: Work / Corporate
tr: İş / Kurumsal

# categoryEmail
source: Email
tr: E-Posta

# categoryGaming
source: Gaming
tr: Oyun

# categoryCardId
source: Card / ID
tr: Kart / Kimlik

# categoryOther
source: Other
tr: Diğer

source: Save
tr: Kaydet

source: Update
tr: Güncelle

source: Delete
tr: Sil

source: Cancel
tr: Vazgeç

source: Edit
tr: Düzenle

source: Copy
tr: Kopyala

source: Show
tr: Göster

source: Hide
tr: Gizle

source: New Record
tr: Yeni Kayıt

source: Update Record
tr: Kaydı Güncelle

# deleteConfirmTitle
source: Are you sure you want to delete?
tr: Silmek istediğine emin misin?

# deleteConfirmMessage
source: {label} will be permanently deleted.
tr: {label} kaydı kalıcı olarak silinecek.

# saved
source: {label} saved
tr: {label} kaydedildi

# updated
source: {label} updated
tr: {label} güncellendi

# deleted
source: {label} deleted
tr: {label} silindi

# passwordCopied
source: Password copied to clipboard
tr: Şifre panoya kopyalandı

# codeCopied
source: Code copied to clipboard
tr: Kod panoya kopyalandı

# generatePassword
source: Generate Strong Password
tr: Güçlü Şifre Oluştur

# passwordGenerated
source: Strong password generated!
tr: Güçlü şifre oluşturuldu!

# backup
source: Backup / Restore
tr: Yedekle / İçeri Al

source: Export passwords
tr: Şifreleri dışa aktar

# exportPasswordsSubtitle
source: Save as file
tr: Dosya olarak kaydet

source: Import passwords
tr: Şifreleri içe aktar

# importPasswordsSubtitle
source: Restore from your saved file
tr: Kaydettiğin dosyadan geri yükle

source: Encrypt Backup
tr: Yedeği Şifrele

source: Decrypt Backup
tr: Yedeği Çöz

source: Backup Password
tr: Yedekleme Parolası

source: Confirm Password
tr: Parolayı Doğrula

source: Encrypt and Save
tr: Şifrele ve Kaydet

source: Decrypt
tr: Şifreyi Çöz

# backupPasswordHint
source: Don't forget this password. You'll need it to restore the backup.
tr: Bu parolayı sakın unutma. Yedeği geri yüklemek için buna ihtiyacın olacak.

# decryptPasswordHint
source: Enter the backup password to decrypt the file.
tr: Dosyayı çözmek için yedekleme parolasını gir.

# backupSaved
source: Backup securely saved: {path}
tr: Yedek güvenli bir şekilde kaydedildi: {path}

# backupRestored
source: Backup successfully decrypted and loaded
tr: Yedek başarıyla çözüldü ve yüklendi

# backupCancelled
source: Export cancelled
tr: Dışa aktarma iptal edildi

source: No records to backup
tr: Yedeklenecek kayıt bulunamadı

source: PIN Lock
tr: PIN Kilidi

source: Create PIN
tr: PIN oluştur

source: Unlock Vault
tr: Kasayı aç

# pinCreateHint
source: Set a 4-digit PIN to protect your vault.
tr: Kasayı korumak için 4 haneli bir PIN belirle.

# pinUnlockHint
source: Enter your 4-digit PIN to unlock.
tr: Kasanı açmak için 4 haneli PIN'ini gir.

# pinConfirm
source: Confirm PIN
tr: PIN tekrar

source: Unlock
tr: Kilidi Aç

source: Save PIN
tr: PIN'i Kaydet

source: Reset PIN
tr: PIN'i sıfırla

# lockApp
source: Lock
tr: Kilitle

# pin4Digits
source: PIN must be 4 digits
tr: PIN 4 haneli olmalı

# pinMismatch
source: PINs don't match
tr: PIN eşleşmiyor

# pinIncorrect
source: Incorrect PIN
tr: PIN hatalı

source: Biometric Login
tr: Biyometrik Giriş

# biometricReason
source: Use fingerprint or face to unlock your vault
tr: Kasanı açmak için parmak izi veya yüzünü kullan

source: Add 2FA
tr: 2FA ekle

source: Manual add
tr: Manuel ekle

# scanQR
source: Scan QR code
tr: QR kod tara

# no2FARecords
source: No 2FA records yet
tr: Henüz 2FA kaydı yok

# no2FADescription
source: Add code generation for Epic Games, Google, Apple and other accounts here.
tr: Epic Games, Google, Apple ve diğer hesaplar için kod üretimini buradan ekleyebilirsin.

source: Add first account
tr: İlk hesabı ekle

source: Secret Key
tr: Gizli Anahtar

source: Issuer
tr: Sağlayıcı

source: Account Label
tr: Hesap Etiketi

# period
source: Period (seconds)
tr: Süre (saniye)

# digits
source: Digit Count
tr: Basamak Sayısı

# invalidQRCode
source: Invalid or unsupported QR code
tr: QR kod geçersiz veya desteklenmiyor

source: Camera permission denied
tr: Kamera izni reddedildi

source: Security Warning
tr: Güvenlik Uyarısı

# rootDetectedMessage
source: Root or unsafe configuration detected on your device. For your security, the app cannot run on this device.
tr: Cihazınızda Root veya güvensiz yapılandırma tespit edildi. Güvenliğiniz için uygulama bu cihazda çalıştırılamaz.

source: Close
tr: Kapat

# emptyState
source: No records yet
tr: Henüz kayıt yok

# emptyStateDescription
source: Add your first record to securely store your passwords.
tr: Şifrelerini güvenle saklamak için ilk kaydını ekle.

# validationTitleRequired
source: Title is required
tr: Başlık zorunlu

# validationPasswordRequired
source: Password cannot be empty
tr: Şifre alanı boş bırakılamaz

# validationPasswordMin6
source: Must be at least 6 characters
tr: En az 6 karakter olmalı

# validationPasswordsMismatch
source: Passwords don't match
tr: Parolalar eşleşmiyor

# validationSecretRequired
source: Secret key is required
tr: Gizli anahtar gerekli

# validationPeriodInvalid
source: Enter valid period
tr: Geçerli süre girin

# validationDigitsInvalid
source: Digit count must be between 6-8
tr: Basamak sayısı 6-8 arası olmalı

# daysAgo
source: {count} days ago
tr: {count} gün önce

# hoursAgo
source: {count} hours ago
tr: {count} saat önce

# minutesAgo
source: {count} min ago
tr: {count} dk önce

source: just now
tr: az önce

source: Strong password generated!
tr: Güçlü şifre oluşturuldu!

# categorySocial
source: Social Media
tr: Sosyal Medya

# categoryBanking
source: Banking / Finance
tr: Banka / Finans

# categoryWork
source: Work / Corporate
tr: İş / Kurumsal

# categoryCard
source: Card / ID
tr: Kart / Kimlik

# usernameHelper
source: Email, cardholder, or leave blank
tr: E-posta, kart sahibi veya boş

source: Password / PIN
tr: Şifre / PIN

source: Generate Strong Password
tr: Güçlü Şifre Oluştur

source: No records yet
tr: Henüz kayıt yok

# emptyStateMessage
source: Add your first password to start filling your vault.
tr: İlk şifreni ekleyerek kasanı doldurmaya başla.

# recordsCount
source: {count} records
tr: {count} kayıt

# welcomeTitle
source: Welcome to Your Password Vault
tr: Şifre Kasana Hoş Geldin

# welcomeSubtitle
source: Keep your passwords safe, find them in seconds when you need.
tr: Şifrelerini güvende tut, gerektiğinde saniyeler içinde bul.

source: Backup / Restore
tr: Yedekle / İçeri Al

source: User
tr: Kullanıcı

# searchHint
source: Search in passwords
tr: Şifreler içinde ara

# updateTwoFactor
source: Update 2FA Record
tr: 2FA Kaydını Güncelle

# newTwoFactor
source: New 2FA Record
tr: Yeni 2FA Kaydı

source: Account Name
tr: Hesap Adı

# accountNameHint
source: e.g. Epic Games
tr: Örn. Epic Games

# validationAccountNameRequired
source: Account name is required
tr: Hesap adı zorunlu

source: Service / Platform (optional)
tr: Servis / Platform (opsiyonel)

# validationSecretKeyRequired
source: Secret key is required
tr: Gizli anahtar gerekli

# validationSecretKeyTooShort
source: Enter a longer key
tr: Daha uzun bir anahtar girin

# periodSeconds
source: Period (sec)
tr: Süre (sn)

# validationDigitsRange
source: Must be between 4-8
tr: 4-8 arası olmalı

# scanQRInstructions
source: Scan the QR code by placing it inside the frame. The account will be added automatically.
tr: QR kodu kare içine alarak taratın. Kod taranır taranmaz hesap kaydedilir.

# pinResetMessage
source: PIN has been reset. Please set a new PIN.
tr: PIN sıfırlandı. Yeni PIN belirleyin.

# twoFactorAdded
source: {label} added
tr: {label} eklendi

# twoFactorUpdated
source: {label} updated
tr: {label} güncellendi

source: Delete Record
tr: Kaydı Sil

# confirmDelete2FA
source: Are you sure you want to delete 2FA record for {label}?
tr: {label} için 2FA kaydını silmek istediğine emin misin?

# twoFactorDeleted
source: {label} deleted
tr: {label} silindi

source: Lock
tr: Kilitle

# addTwoFactor
source: Add 2FA
tr: 2FA ekle

# noTwoFactorYet
source: No 2FA records yet
tr: Henüz 2FA kaydı yok

# emptyTwoFactorMessage
source: Add code generation for Epic Games, Google, Apple, and other accounts here.
tr: Epic Games, Google, Apple ve diğer hesaplar için kod üretimini buradan ekleyebilirsin.

source: Secure Notes
tr: Güvenli Notlar

source: Notes
tr: Notlar

source: New Note
tr: Yeni Not

source: Update Note
tr: Notu Güncelle

# noteTitle
source: Title
tr: Başlık

# noteTitleHint
source: e.g. Wi-Fi Password, Tax Number...
tr: Örn. Wi-Fi Şifresi, Vergi Numarası...

# noteContent
source: Content
tr: İçerik

# noteContentHint
source: Write your note content here...
tr: Not içeriğini buraya yaz...

# validationNoteTitleRequired
source: Title is required
tr: Başlık zorunlu

# validationNoteContentRequired
source: Content is required
tr: İçerik zorunlu

# noteCategoryPersonal
source: Personal
tr: Kişisel

# noteCategoryCrypto
source: Crypto
tr: Kripto

# noteCategoryTax
source: Tax / Financial
tr: Vergi / Mali

# noteCategoryDocuments
source: Documents
tr: Belgeler

# noteCategoryOther
source: Other
tr: Diğer

# noteSaved
source: {title} saved
tr: {title} kaydedildi

# noteUpdated
source: {title} updated
tr: {title} güncellendi

# noteDeleted
source: {title} deleted
tr: {title} silindi

# deleteNoteConfirmMessage
source: {title} note will be permanently deleted.
tr: {title} notu kalıcı olarak silinecek.

source: No notes yet
tr: Henüz not yok

# emptyNotesMessage
source: Add your first secure note to get started.
tr: İlk güvenli notunu ekleyerek başla.

# searchNotesHint
source: Search in notes
tr: Notlar içinde ara

# contentCopied
source: Content copied to clipboard
tr: İçerik panoya kopyalandı

# updatedAt
source: Updated
tr: Güncelleme

source: Appearance
tr: Görünüm

source: Theme
tr: Tema

# themeSystem
source: System
tr: Sistem

# themeLight
source: Light
tr: Aydınlık

# themeDark
source: Dark
tr: Karanlık

source: Language
tr: Dil

source: Data Management
tr: Veri Yönetimi

source: Export Data
tr: Verileri Dışa Aktar

# exportDataSubtitle
source: Backup all passwords and notes
tr: Tüm şifreleri ve notları yedekle

source: Import Data
tr: Verileri İçe Aktar

# importDataSubtitle
source: Restore from backup
tr: Yedekten geri yükle

# importWarning
source: Current data will be merged with the backup content. Do you want to continue?
tr: Mevcut veriler yedeğin içeriği ile birleştirilecek. Devam etmek istiyor musun?

# continueAction
source: Continue
tr: Devam Et

source: records backed up
tr: kayıt yedeklendi

source: records imported
tr: kayıt içe aktarıldı

source: Security
tr: Güvenlik

# resetPinSubtitle
source: Change your PIN code
tr: PIN kodunu değiştir

# resetPinConfirmMessage
source: Are you sure you want to reset your PIN? You will need to create a new one.
tr: PIN kodunu sıfırlamak istediğine emin misin? Yeni bir PIN oluşturman gerekecek.

source: Reset
tr: Sıfırla

source: About
tr: Hakkında

source: App Version
tr: Uygulama Sürümü
